<template>
  <div class="header-control__cart-container">
    <!--Кнопка корзины для мобилок-->
    <a class="header-control__button header-control__button_cart" href="/checkout/" title="Перейти в корзину">
      <svg width="20" height="22" viewBox="0 0 20 22" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M10.1835 19.1055C10.1835 18.5929 10.0315 18.0918 9.7467 17.6656C9.46192 17.2394 9.05714 16.9072 8.58356 16.711C8.10998 16.5149 7.58887 16.4636 7.08612 16.5636C6.58337 16.6636 6.12157 16.9104 5.75911 17.2729C5.39664 17.6353 5.1498 18.0971 5.0498 18.5999C4.9498 19.1026 5.00112 19.6237 5.19729 20.0973C5.39345 20.5709 5.72564 20.9757 6.15185 21.2605C6.57806 21.5452 7.07915 21.6973 7.59174 21.6973C8.27912 21.6973 8.93834 21.4242 9.42438 20.9381C9.91043 20.4521 10.1835 19.7929 10.1835 19.1055ZM6.83486 19.1055C6.83486 18.9558 6.87925 18.8095 6.96242 18.685C7.04559 18.5605 7.1638 18.4635 7.3021 18.4062C7.4404 18.349 7.59258 18.334 7.7394 18.3632C7.88623 18.3924 8.02109 18.4645 8.12694 18.5703C8.23279 18.6762 8.30488 18.811 8.33408 18.9578C8.36329 19.1047 8.3483 19.2569 8.29101 19.3952C8.23372 19.5335 8.13671 19.6517 8.01224 19.7348C7.88778 19.818 7.74144 19.8624 7.59174 19.8624C7.39101 19.8624 7.19849 19.7826 7.05655 19.6407C6.91461 19.4988 6.83486 19.3062 6.83486 19.1055Z" fill="black"/>
        <path d="M18.0276 19.1055C18.0276 18.5929 17.8756 18.0918 17.5908 17.6656C17.306 17.2394 16.9013 16.9072 16.4277 16.711C15.9541 16.5149 15.433 16.4636 14.9302 16.5636C14.4275 16.6636 13.9657 16.9104 13.6032 17.2729C13.2408 17.6353 12.9939 18.0971 12.8939 18.5999C12.7939 19.1026 12.8452 19.6237 13.0414 20.0973C13.2376 20.5709 13.5698 20.9757 13.996 21.2605C14.4222 21.5452 14.9233 21.6973 15.4359 21.6973C16.1232 21.6973 16.7825 21.4242 17.2685 20.9381C17.7545 20.4521 18.0276 19.7929 18.0276 19.1055ZM14.679 19.1055C14.679 18.9558 14.7234 18.8095 14.8065 18.685C14.8897 18.5605 15.0079 18.4635 15.1462 18.4062C15.2845 18.349 15.4367 18.334 15.5835 18.3632C15.7303 18.3924 15.8652 18.4645 15.9711 18.5703C16.0769 18.6762 16.149 18.811 16.1782 18.9578C16.2074 19.1047 16.1924 19.2569 16.1351 19.3952C16.0778 19.5335 15.9808 19.6517 15.8564 19.7348C15.7319 19.818 15.5856 19.8624 15.4359 19.8624C15.2351 19.8624 15.0426 19.7826 14.9007 19.6407C14.7587 19.4988 14.679 19.3062 14.679 19.1055Z" fill="black"/>
        <path d="M4.51835 16.3991H17.844V14.5642H6.07798L5.87156 13.2339H18.578L20 3.55505H4.3578L4.0367 1.5367L0.275229 0.963303L0 2.77523L2.43119 3.1422L4.51835 16.3991ZM17.867 5.38991L16.9954 11.3991H5.59633L4.63303 5.38991H17.867Z" fill="black"/>
      </svg>
      <span class="header-control__notifications">{{availableProducts.length}}</span>
    </a>
    
    <!-- Кнопка корзины для десктопа-->
    <div class="header-control__cart">
      
      <a class="button-cart btn btn-red btn-skew" href="/checkout/" title="Перейти в корзину">
        <div class="btn-skew__revers button-cart__inner">
          <div class="button-cart__num">{{availableProducts.length}}</div>
          <div class="button-cart__block">
            <div class="button-cart__title">Корзина</div>
            <div class="button-cart__price" v-if="totalPrice > 0">{{totalPrice | formatPrice}}</div>
          </div>
        </div>
      </a>
      
      <div class="header-cart">
        <div class="header-cart__wrapper" data-simplebar="init" data-simplebar-auto-hide="false">
          <div class="header-cart__header">
            <div class="header-cart__title">Товары в корзине</div>
            <button class="header-cart__btn-clear" type="button" @click="clearCart">
              <svg viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M12.9504 2.08658H9.80004V1.39147C9.80004 0.624178 9.17262 0 8.40011 0H5.59971C4.8281 0 4.19996 0.624178 4.19996 1.39147V2.08658H1.04963C0.471056 2.08658 0 2.55449 0 3.1312V5.5648H0.699517V13.2172C0.699517 14.7513 1.95525 16 3.49973 16H10.5004C12.0448 16 13.3005 14.7513 13.3005 13.2174V5.56498H14V3.1312C14 2.55449 13.5286 2.08658 12.9504 2.08658ZM5.59971 1.39147H8.40011V2.08658H5.59971V1.39147ZM11.9006 13.2174C11.9006 13.9847 11.273 14.6084 10.5004 14.6084H3.49973C2.72794 14.6084 2.09962 13.9849 2.09962 13.2174V5.56498H11.9006V13.2174ZM1.39975 4.17351V3.47769H12.6001V4.17351H1.39975ZM3.49973 13.2174V6.95627C3.49973 6.57156 3.81335 6.26009 4.19996 6.26009C4.58586 6.26009 4.89984 6.57156 4.89984 6.95627V13.2174C4.89984 13.6016 4.58586 13.9134 4.19996 13.9134C3.81335 13.9134 3.49973 13.6014 3.49973 13.2174ZM6.30013 13.2174V6.95627C6.30013 6.57156 6.61374 6.26009 7 6.26009C7.38733 6.26009 7.69987 6.57156 7.69987 6.95627V13.2174C7.69987 13.6016 7.38733 13.9134 7 13.9134C6.61374 13.9134 6.30013 13.6014 6.30013 13.2174ZM9.10016 13.2174V6.95627C9.10016 6.57156 9.41324 6.26009 9.80004 6.26009C10.187 6.26009 10.5003 6.57156 10.5003 6.95627V13.2174C10.5003 13.6016 10.187 13.9134 9.80004 13.9134C9.41324 13.9134 9.10016 13.6014 9.10016 13.2174Z" fill="currentColor"/>
              </svg>
              Очистить
            </button>
          </div>
          <div class="header-cart__item">
            
            <div class="h-product-item"
                    v-for="item in items"
                    :key="item.basketItemId"
                    :class="{ disabled: item.canBuy }">
              <div class="h-product-item__img">
                <img :src="item.picture" :alt="item.name">
              </div>
              <div class="h-product-item__info">
                <a :href="item.url" class="h-product-item__name">{{item.name}}</a>
                <div class="h-product-item__description">{{item.pack}}</div>
              </div>
              <div class="h-product-item__controls">
                <div class="h-product-item__price-block">
                  <span class="h-product-item__price price">{{item.sum | formatPrice}}</span>
                  <button class="h-product-item__remove" type="button" @click="remove(item)">
                    <svg viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M12.9504 2.08658H9.80004V1.39147C9.80004 0.624178 9.17262 0 8.40011 0H5.59971C4.8281 0 4.19996 0.624178 4.19996 1.39147V2.08658H1.04963C0.471056 2.08658 0 2.55449 0 3.1312V5.5648H0.699517V13.2172C0.699517 14.7513 1.95525 16 3.49973 16H10.5004C12.0448 16 13.3005 14.7513 13.3005 13.2174V5.56498H14V3.1312C14 2.55449 13.5286 2.08658 12.9504 2.08658ZM5.59971 1.39147H8.40011V2.08658H5.59971V1.39147ZM11.9006 13.2174C11.9006 13.9847 11.273 14.6084 10.5004 14.6084H3.49973C2.72794 14.6084 2.09962 13.9849 2.09962 13.2174V5.56498H11.9006V13.2174ZM1.39975 4.17351V3.47769H12.6001V4.17351H1.39975ZM3.49973 13.2174V6.95627C3.49973 6.57156 3.81335 6.26009 4.19996 6.26009C4.58586 6.26009 4.89984 6.57156 4.89984 6.95627V13.2174C4.89984 13.6016 4.58586 13.9134 4.19996 13.9134C3.81335 13.9134 3.49973 13.6014 3.49973 13.2174ZM6.30013 13.2174V6.95627C6.30013 6.57156 6.61374 6.26009 7 6.26009C7.38733 6.26009 7.69987 6.57156 7.69987 6.95627V13.2174C7.69987 13.6016 7.38733 13.9134 7 13.9134C6.61374 13.9134 6.30013 13.6014 6.30013 13.2174ZM9.10016 13.2174V6.95627C9.10016 6.57156 9.41324 6.26009 9.80004 6.26009C10.187 6.26009 10.5003 6.57156 10.5003 6.95627V13.2174C10.5003 13.6016 10.187 13.9134 9.80004 13.9134C9.41324 13.9134 9.10016 13.6014 9.10016 13.2174Z" fill="currentColor"/>
                    </svg>
                  </button>
                </div>
                <div class="input-counter">
                  <button class="input-counter__down" type="button" @click.prevent="decrement(item)">-</button>
                  <span class="input-counter__count">{{item.quantity}}</span>
                  <button class="input-counter__up" type="button" @click.prevent="increment(item)">+</button>
                </div>
              </div>
            </div>
          </div>
        
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  import { mapGetters, mapState, mapActions } from 'vuex';

  export default {
    name: "HeaderBasket",
    computed: {
      ...mapState('cart', {
        items: state => state.items,
      }),
      ...mapGetters('cart', [
        'availableProducts'
      ]),
      totalPrice() {
        return this.availableProducts.reduce((sum, item) => sum + item.sum, 0);
      }
    },
    methods: {
      ...mapActions('cart', {
        clearCart: 'clearCart',
        increment: 'incrementItemQuantity',
        decrement: 'decrementItemQuantity',
        remove: 'removeFromCart',
      })
    }
  }
</script>

<style scoped>

</style>
